bash/README.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>DOT BASH</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-10-23 17:06:28 EDT"/>
<meta name="author" content="bv"/>
</head><body>
<h1 class="title">DOT BASH</h1>

<p>This area sets up the interactive bash session for all accounts.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Installation </a></li>
<li><a href="#sec-2">2 How it works </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">1 Installation </h2>
<div id="text-1">


<p>
Run ../install.sh in a new account.  It creates .bash<sub>login</sub>,
.bash<sub>logout</sub> and .bashrc as symlinks to files of the same, non-dotted
names in this directory.  If any of these files exists, they will be
moved asside.  If .profile or .bash<sub>profile</sub> exist they will be moved
aside.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">2 How it works </h2>
<div id="text-2">


<p>
The usual rc files will load all relevant configuration chunks found
under
</p>



<pre class="example">
~/dot/bash/{login,logout,rc}/DIR/*
</pre>




<p>
Where <code>DIR</code> is expanded in turn to to be the string "any", followed by
</p>



<pre class="example">
uname -s             # Kernel name (Linux)
lsb_release -s -i    # Distribution name (Ubuntu, Debian)
lsb_release -s -c    # Distribution codename (maverik, squeeze)
hostname -d          # Domain name
uname -n             # Hostname
</pre>




<p>
Interactive logins first source <code>~/.bashrc</code> followed by any relevant
chunks under <code>login/</code>.
</p>
<p>
Individual script chunks can make use of functions defined in 
</p>



<pre class="example">
~/dot/bash/common.sh
~/dot/bash/common/*
</pre>




</div>
</div>
<div id="postamble"><p class="author"> Author: bv
<a href="mailto:bv@hal">&lt;bv@hal&gt;</a>
</p>
<p class="date"> Date: 2010-10-23 17:06:28 EDT</p>
<p>HTML generated by org-mode 6.21b in emacs 23</p>
</div></body>
</html>
